### Connecting to Postgresql

In [ ]:
pip install sqlalchemy #helps python program to talk to databases

In [ ]:
pip install psycopg2-binary #programs to connect to and work with PostgreSQL databases

In [7]:
%load_ext sql
from sqlalchemy import create_engine
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [ ]:
pip install ipython-sql

In [ ]:
%sql postgresql://postgres:@localhost:5432/customerdb #connection string

### 1. Customer Demographics

## Overview

### 1.1 How does customer demographics and account usage vary across different income  groups and age groups?

In [10]:
%%sql SELECT 
    i.income_group_desc AS income_group,
    COUNT(c.customer_identifier) AS Total_Customers,
    ROUND(AVG(c.age)) AS Avg_Age,
    ROUND(AVG(c.number_of_accounts)) AS Avg_Number_of_Accounts
FROM 
    customers c
JOIN 
    income_group i
ON 
    c.income_group_code = i.income_group_code
WHERE i.income_group_desc != 'NOT SUPPLIED'
GROUP BY 
    i.income_group_desc, i.income_group_code
ORDER BY 
    i.income_group_code
    Limit 5;

 * postgresql://postgres:***@localhost:5432/customerdb
5 rows affected.

[('R 0 - 499', 62, Decimal('36'), Decimal('8')),
 ('R500 - 999', 30, Decimal('43'), Decimal('7')),
 ('R1,000 - 1,999', 96, Decimal('54'), Decimal('7')),
 ('R2,000 - 2,999', 82, Decimal('47'), Decimal('8')),
 ('R3,000 - 3,999', 150, Decimal('40'), Decimal('8'))]

### 1.2 Customers are catergorised according to their age group/life stage

In [11]:
%%sql 
SELECT 
    CASE 
        WHEN AGE < 25 THEN '16-24: Youth'
        WHEN AGE BETWEEN 25 AND 34 THEN '25-34: Young Professionals'
        WHEN AGE BETWEEN 35 AND 44 THEN '35-44: Middle-Aged Adults'
        WHEN AGE BETWEEN 45 AND 54 THEN '45-54: Prime Working Years'
        WHEN AGE BETWEEN 55 AND 64 THEN '55-64: Pre-Retirement'
        ELSE '65+: Seniors/Elderly'
    END AS age_group_label,
    COUNT(*) AS customer_count,
    ROUND(COUNT(*) * 100.0 / SUM(COUNT(*)) OVER (), 2) AS percentage -- The OVER clause calculates the total customer count across all groups for the percentage calculation.
FROM customers
GROUP BY age_group_label
ORDER BY age_group_label

 * postgresql://postgres:***@localhost:5432/customerdb
6 rows affected.

[('16-24: Youth', 578, Decimal('11.24')),
 ('25-34: Young Professionals', 1799, Decimal('34.97')),
 ('35-44: Middle-Aged Adults', 1498, Decimal('29.12')),
 ('45-54: Prime Working Years', 885, Decimal('17.20')),
 ('55-64: Pre-Retirement', 267, Decimal('5.19')),
 ('65+: Seniors/Elderly', 117, Decimal('2.27'))]

### 1.3 Customer are catergorised according to their age group/life stage and what income group they belong to

In [12]:
 %%sql
 SELECT 
    CASE 
        WHEN AGE < 25 THEN '16-24: Youth'
        WHEN AGE BETWEEN 25 AND 34 THEN '25-34: Young Professionals'
        WHEN AGE BETWEEN 35 AND 44 THEN '35-44: Middle-Aged Adults'
        WHEN AGE BETWEEN 45 AND 54 THEN '45-54: Prime Working Years'
        WHEN AGE BETWEEN 55 AND 64 THEN '55-64: Pre-Retirement'
        ELSE '65+: Seniors/Elderly'
    END AS age_group_label,
    ig.income_group_desc,
    COUNT(*) AS customer_count, 
    ROUND(
        COUNT(*) * 100.0 / 
        SUM(COUNT(*)) OVER (
            PARTITION BY 
            -- PARTITION BY creates separate "windows" for each age group.
            -- This ensures the SUM(COUNT(*)) is calculated independently for each age group.
            CASE 
                WHEN AGE < 25 THEN '16-24: Youth'
                WHEN AGE BETWEEN 25 AND 34 THEN '25-34: Young Professionals'
                WHEN AGE BETWEEN 35 AND 44 THEN '35-44: Middle-Aged Adults'
                WHEN AGE BETWEEN 45 AND 54 THEN '45-54: Prime Working Years'
                WHEN AGE BETWEEN 55 AND 64 THEN '55-64: Pre-Retirement'
                ELSE '65+: Seniors/Elderly'
            END
        )
    , 2) AS percentage_within_age_group, 
    
    ROUND(
        COUNT(*) * 100.0 / 
        SUM(COUNT(*)) OVER () 
        -- OVER () without PARTITION BY applies to the entire dataset.
        -- This calculates the percentage of customers in an income group relative to all customers.
    , 2) AS percentage_of_total_customers 
FROM customers c
JOIN income_group ig 
    ON c.income_group_code = ig.income_group_code 
WHERE ig.income_group_desc != 'NOT SUPPLIED' 
GROUP BY 
    age_group_label, ig.income_group_desc, ig.income_group_code 
ORDER BY 
    age_group_label,
    ig.income_group_code
    Limit 5;

 * postgresql://postgres:***@localhost:5432/customerdb
5 rows affected.

[('16-24: Youth', 'R 0 - 499', 14, Decimal('2.43'), Decimal('0.27')),
 ('16-24: Youth', 'R500 - 999', 4, Decimal('0.69'), Decimal('0.08')),
 ('16-24: Youth', 'R1,000 - 1,999', 7, Decimal('1.21'), Decimal('0.14')),
 ('16-24: Youth', 'R2,000 - 2,999', 7, Decimal('1.21'), Decimal('0.14')),
 ('16-24: Youth', 'R3,000 - 3,999', 18, Decimal('3.12'), Decimal('0.35'))]

### 1.4 How does the number of accounts owned by a customer relate to their transaction behavior in terms of count and total amount

In [13]:
%%sql

SELECT
    c.number_of_accounts,
    COUNT(t.transaction_id) AS transaction_count,
    ROUND(SUM(t.amt)) AS total_amount
FROM customers c
JOIN transactions t ON c.customer_identifier = t.customer_identifier
GROUP BY c.number_of_accounts
ORDER BY c.number_of_accounts
Limit 5;

 * postgresql://postgres:***@localhost:5432/customerdb
5 rows affected.

[(2, 1296, 82709.0),
 (3, 6830, 208634.0),
 (4, 19690, 875208.0),
 (5, 40811, 1226795.0),
 (6, 59643, 1478617.0)]

### 1.5 Active vs Inactive customers

In [14]:
%%sql 
SELECT 
    customer_status, 
    COUNT(*) AS customer_count, 
    ROUND(100.0 * COUNT(*) / (SELECT COUNT(*) FROM customers), 2) AS percentage
FROM (
    SELECT 
        c.customer_identifier,
        CASE 
            WHEN t.last_transaction_date >= '2022-03-01' THEN 'Active'
            ELSE 'Inactive'
        END AS customer_status
    FROM 
        customers c
    LEFT JOIN (
        SELECT 
            customer_identifier, 
            MAX(record_date) AS last_transaction_date
        FROM 
            transactions
        GROUP BY 
            customer_identifier
    ) t
    ON c.customer_identifier = t.customer_identifier
) sub
GROUP BY customer_status;

 * postgresql://postgres:***@localhost:5432/customerdb
2 rows affected.

[('Active', 4794, Decimal('93.20')), ('Inactive', 350, Decimal('6.80'))]